{"name": "Learn how to use Python with Pandas, Matplotlib, and other modules to gather insights from and about your data."}
{"name": "Control hardware with Python programming and the Raspberry Pi."}
{"name": "How to develop websites with either the Flask or Django frameworks for Python."}
{"name": "Create your own games with Python's PyGame library, or check out the multi-platform Kivy."}
{"name": "Learn the basic and intermediate Python fundamentals."}
{"name": "Create software with a user interface using Tkinter, PyQt, or Kivy."}
{"name": "Create up-to-date looking graphical user interfaces with PyQt."}
{"name": "Tkinter, part of the Python standard library, can be used to create simple GUI applications."}
{"name": "Create cross-platform (Windows, Mac, Linux, iOS, and Android) games and applications with Python's Kivy."}
{"name": "Just getting started?"}
{"name": "Python fundamentals that aren't basic."}
{"name": "How to setup and use your Raspberry Pi with various projects."}
{"name": "Use the Raspberry Pi along with the GoPiGo to learn about robotics."}
{"name": "Build and program your own quadcopter from scratch to take-off."}
{"name": "Employ both supervised and unsupervised machine learning, to make predictions or to understand data."}
{"name": "Use Python with Pandas, Matplotlib, and other modules to gather insights from and about your data."}
{"name": "Using Matplotlib, graphically display your data for presentation or analysis."}
{"name": "Devise, create, test, and deploy automated algorithmic trading strategies in the financial markets."}
{"name": "From launching a simple virtual machine to deploying advanced machine learning APIs with Python."}
{"name": "Analyze video and images with your machine to program tasks like face and object recognition."}
{"name": "Use MPI with machines to do distributed and parallel computing tasks."}
{"name": "Teach machines to read, understand, and analyze human natural language."}
{"name": "Learn the basics of creating various websites with the Flask Python micro-framework."}
{"name": "Create websites with the higher-level framework, Django."}
{"name": "Flask and the other web frameworks besides Django are lower-level (sometimes called micro) frameworks. This means they are mainly meant to provide only the bare minimum of tools to get your website running. The underlying system of logic, design, and organization is done almost entirely by the developer from this point."}
{"name": "Develop games in Python with PyGame."}
{"name": "Implement OpenGL technology with PyGame using PyOpenGL."}
{"name": "Create cross-platform (Windows, Mac, Linux, iOS, and Android) games and applications with Python's Kivy."}
{"name": "Learn how to do finance with Python, from getting data, to manipulating data, to formulating and testing trading strategies."}
{"name": "Learn how to deploy a support vector machine with Scikit Learn."}
{"name": "Learn theory, real world application, and the inner workings of regression, classification, clustering, and deep learning."}
{"name": "Training Python how to play and do a self-driving car in Grand Theft Auto 5 through machine learning and other statistical approaches."}
{"name": "Learn how to detect and track objects in images or real time video with TensorFlow."}
{"name": "Learn how to deploy a support vector machine with Scikit Learn."}
{"name": "Learn about clustering (unsupervised machine learning) through using Scikit Learn."}
{"name": "Discover how powerful even a very simple pattern recognition algorithm can be with character recognition."}
